object purana extends App {
  class கதைமாந்தர்(val பெயர்: String) {
    def வணங்கு() = println(s"$பெயர் : போற்றி!")
  }
  class நாயகன்(val பெ: String) extends கதைமாந்தர்(பெ) {
    def நற்செய்(செயல்: String, மா: கதைமாந்தர்) = println(s"$பெயர் : ${மா.பெயர்} க்கு  $செயல் அருளினோம்.") 
    def அழி(எ: எதிரி) = println(s"$பெயர் : ${எ.பெயர்} க்கு  திதி செய்தோம்.")
  }
  class நாயகி(val பெ: String) extends கதைமாந்தர்(பெ) {
    def பணிவிடைசெய்(செயல்: String, மா: கதைமாந்தர்) = println(s"$பெயர் : ${மா.பெயர்}க்கு $செயல் பணிந்தோம்.")
    def மணமுடி(நா: நாயகன்) = println(s"$பெயர் : ${நா.பெயர்}-ன் கைப் பற்றினோம்.")
  }
  class எதிரி(val பெ: String) extends கதைமாந்தர்(பெ) {
    def கேடுசெய்(செயல்: String, மா: கதைமாந்தர்) = println (s"$பெயர் : ${மா.பெயர்}க்கு கேடாய் மக்களுக்காக $செயல் செய்தோம்.")
  }


   val k1 = new நாயகன்("இராமு")
   val k2 = new நாயகி("சாமு")
   val k3 = new எதிரி("கோமு")
   val k4 = new கதைமாந்தர்("அணிமு")
   val k5 = new கதைமாந்தர்("ஆமு")
     
   k1.நற்செய்("தடவுதல்", k4)
   k1.நற்செய்("ஏவுதல்", k5)
   k3.கேடுசெய்("கடத்தல்", k2)
   k3.கேடுசெய்("தீ வை", k5)
   k1.அழி(k3)
   k2.மணமுடி(k1)
   
   for (k <- List(k3, k4, k5))
     k.வணங்கு
}